arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/inc/fsl_lpi2c_driver.h
/*
 * Copyright (c) 2014 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef __FSL_LPI2C_DRIVER_H__
#define __FSL_LPI2C_DRIVER_H__

#include <stddef.h>
#include <stdbool.h>
#include "fsl_device_registers.h"
#include "fsl_lpi2c_hal.h"

/*!
 * @addtogroup lpi2c_drv
 * @{
 */

/*******************************************************************************
 * Enumerations.
 ******************************************************************************/

/*! @cond DRIVER_INTERNAL_USE_ONLY */
/* Size of the master command queue. Worst case: 5 commands in High-Speed receive with 10-bit address:
   START + master code, REP START + addr_1 + tx, addr_2, REP START + addr_1 + rx, receive command */
#define LPI2C_MASTER_CMD_QUEUE_SIZE   5U
/*! @endcond */

/*! @brief I2C operating modes */
typedef enum _lpi2c_mode{
    LPI2C_STANDARD_MODE      = 0x0U,   /*!< Standard-mode (Sm), bidirectional data transfers up to 100 kbit/s */
    LPI2C_FAST_MODE          = 0X1U,   /*!< Fast-mode (Fm), bidirectional data transfers up to 400 kbit/s */
    LPI2C_FASTPLUS_MODE      = 0x2U,   /*!< Fast-mode Plus (Fm+), bidirectional data transfers up to 1 Mbit/s */
    LPI2C_HIGHSPEED_MODE     = 0x3U,   /*!< High-speed Mode (Hs-mode), bidirectional data transfers up to 3.4 Mbit/s */
    LPI2C_ULTRAFAST_MODE     = 0x4U    /*!< Ultra Fast Mode (UFm), unidirectional data transfers up to 5 Mbit/s */
} lpi2c_mode_t;

/*! @brief LPI2C slave events */
typedef enum lpi2c_slave_event
{
    LPI2C_SLAVE_EVENT_TX_REQ   = 0x02U,    /*!< The I2C slave received a request to transmit data */
    LPI2C_SLAVE_EVENT_RX_REQ   = 0x04U,    /*!< The I2C slave received a request to receive data */
    LPI2C_SLAVE_EVENT_TX_EMPTY = 0x10U,    /*!< The I2C slave transmit buffer empty */
    LPI2C_SLAVE_EVENT_RX_FULL  = 0x20U,    /*!< The I2C slave receive buffer full */
    LPI2C_SLAVE_EVENT_STOP = 0x80U,        /*!< The I2C slave STOP signal detected */
} lpi2c_slave_event_t;

/*! @brief LPI2C driver status codes */
typedef enum lpi2c_status {
    LPI2C_STATUS_SUCCESS            = 0U,  /*!< Operation successful */
    LPI2C_STATUS_FAIL               = 1U,  /*!< Operation failed */
    LPI2C_STATUS_BUSY               = 2U,  /*!< Already busy with a transfer */
    LPI2C_STATUS_RECEIVED_NACK      = 3U,  /*!< NACK signal received  */
    LPI2C_STATUS_SLAVE_TX_UNDERRUN  = 4U,  /*!< Slave TX underrun error */
    LPI2C_STATUS_SLAVE_RX_OVERRUN   = 5U,  /*!< Slave RX overrun error */
    LPI2C_STATUS_ARIBTRATION_LOST   = 6U,  /*!< Arbitration lost */
    LPI2C_STATUS_ABORTED            = 7U,  /*!< A transfer was aborted */
    LPI2C_STATUS_NO_TRANSFER        = 8U,  /*!< Attempt to abort a transfer when no transfer was in progress */
} lpi2c_status_t;

/*******************************************************************************
* Definitions
******************************************************************************/

/*!
 * @brief Defines the example structure
 *
 * This structure is used as an example.
 */

/*!
 * @brief LPI2C slave callback function
 *
 * Callback functions are called by the LPI2C slave when relevant events are detected on the I2C bus.
 * See type lpi2c_slave_event_t for a list of events. The callback can then react to the event, for example
 * providing the buffers for transmission or reception.
 */
typedef void (*lpi2c_slave_callback_t)(uint8_t instance, lpi2c_slave_event_t slaveEvent, void *userData);

 /*!
 * @brief Master configuration structure
 *
 * This structure is used to provide configuration parameters for the LPI2C master at initialization time.
 */
typedef struct _lpi2c_master_user_config_t
{
    uint16_t slaveAddress;         /*!< Slave address, 7-bit or 10-bit */
    bool is10bitAddr;              /*!< Selects 7-bit or 10-bit slave address */
    lpi2c_mode_t operatingMode;    /*!< I2C Operating mode */
    uint8_t masterCode;            /*!< Master code for High-speed mode. Valid range: 0-7. Unused in other operating modes */
    uint32_t baudRate;             /*!< The baud rate in hertz to use with current slave device */
    uint32_t baudRateHS;           /*!< Baud rate for High-speed mode. Unused in other operating modes */
} lpi2c_master_user_config_t;

/*!
 * @brief Slave configuration structure
 *
 * This structure is used to provide configuration parameters for the LPI2C slave at initialization time.
 */
typedef struct _lpi2c_slave_user_config_t
{
    uint16_t slaveAddress;                   /*!< Slave address, 7-bit or 10-bit */
    bool is10bitAddr;                        /*!< Selects 7-bit or 10-bit slave address */
    lpi2c_mode_t operatingMode;              /*!< I2C Operating mode */
    bool slaveListening;                     /*!< Slave mode (always listening or on demand only) */
    lpi2c_slave_callback_t slaveCallback;    /*!< Slave callback function. Note that this function will be 
                                                  called from the interrupt service routine, so its 
                                                  execution time should be as small as possible. It can be 
                                                  NULL if the slave is not in listening mode 
                                                  (slaveListening = false) */
    void *callbackParam;                     /*!< Parameter for the slave callback function */
} lpi2c_slave_user_config_t;

/*! @cond DRIVER_INTERNAL_USE_ONLY */
/* Master software command queue */
typedef struct _lpi2c_master_cmd_queue_t
{
    lpi2c_master_command_t cmd[LPI2C_MASTER_CMD_QUEUE_SIZE];
    uint8_t data[LPI2C_MASTER_CMD_QUEUE_SIZE];
    uint8_t writeIdx;
    uint8_t readIdx;
} lpi2c_master_cmd_queue_t;
/*! @endcond */

/*!
 * @brief Master internal context structure
 *
 * This structure is used by the master-mode driver for its internal logic. It must
 * be provided by the application through the LPI2C_DRV_MasterInit() function, then
 * it cannot be freed until the driver is de-initialized using LPI2C_DRV_MasterDeinit().
 * The application should make no assumptions about the content of this structure.
 */
typedef struct _lpi2c_master_state_t
{
/*! @cond DRIVER_INTERNAL_USE_ONLY */
    lpi2c_master_cmd_queue_t cmdQueue;    /* Software queue for commands, when LPI2C FIFO is not big enough */
    uint8_t * rxBuff;                     /* Pointer to receive data buffer */
    uint32_t rxSize;                      /* Size of receive data buffer */
    const uint8_t * txBuff;               /* Pointer to transmit data buffer */
    uint32_t txSize;                      /* Size of transmit data buffer */
    volatile lpi2c_status_t status;       /* Status of last driver operation */
    lpi2c_mode_t operatingMode;           /* I2C Operating mode */
    uint16_t slaveAddress;                /* Slave address */
    uint8_t masterCode;                   /* Master code for High-speed mode */
    volatile bool i2cIdle;                /* Idle/busy state of the driver */
    bool highSpeedInProgress;             /* High-speed communication is in progress */
    bool isBlocking;                      /* Specifies if current transfer is blocking */
    bool sendStop;                        /* Specifies if STOP condition must be generated after current transfer */
    bool is10bitAddr;                     /* Selects 7-bit or 10-bit slave address */
/*! @endcond */
} lpi2c_master_state_t;

/*!
 * @brief Slave internal context structure
 *
 * This structure is used by the slave-mode driver for its internal logic. It must
 * be provided by the application through the LPI2C_DRV_SlaveInit() function, then
 * it cannot be freed until the driver is de-initialized using LPI2C_DRV_SlaveDeinit().
 * The application should make no assumptions about the content of this structure.
 */
typedef struct _lpi2c_slave_state_t
{
/*! @cond DRIVER_INTERNAL_USE_ONLY */
    lpi2c_status_t status;                 /* The I2C slave status */
    volatile bool txBusy;                  /* Transmitter is busy */
    volatile bool rxBusy;                  /* Receiver is busy */
    uint32_t txSize;                       /* Size of the TX buffer*/
    uint32_t rxSize;                       /* Size of the RX buffer*/
    const uint8_t * txBuff;                /* Pointer to Tx Buffer*/
    uint8_t * rxBuff;                      /* Pointer to Rx Buffer*/
    lpi2c_mode_t operatingMode;            /* I2C Operating mode */
    bool slaveListening;                   /* Slave mode (always listening or on demand only) */
    bool txUnderrunWarning;                /* Possible slave tx underrun */
    lpi2c_slave_callback_t slaveCallback;  /* Slave callback function */
    void *callbackParam;                   /* Parameter for the slave callback function */
/*! @endcond */
} lpi2c_slave_state_t;

